{
  "recipes": [
    {
      "name": "Aubergine Curry",
      "source": "https://instagram.com/p/CbX5D_BpBMO",
      "image": "auberginecurry.jpg",
      "servings": 3,
      "ingredients": [
        "2 aubergines",
        "1 white onion",
        "4 garlic cloves",
        "3 tsp curry powder",
        "1.5 tsp turmeric powder",
        "1 tsp chili flakes",
        "1 cup of veg stock",
        "4 tbsp peanut butter",
        "1 can coconut milk",
        "1 block of tofu",
        "1 tsp brown sugar",
        "1 tsp soy sauce"
      ],
      "methods": [
        "Slice up the aubergines into segments or cubes and shallowing frying them until brown",
        "Once aubergines start browning, add a dash of water, cover and let the aubergines steam, do this until aubergines are tender",
        "Dice onions and garlic and sauté until soft/translucent. Add extra oil if necessary at this point.",
        "Deglaze with vegetable stock and bring that up to a simmer.",
        "Add peanut butter and allow this to melt into the sauce then add coconut milk to get your desired creaminess.",
        "Add all-purpose seasoning and garlic powder. Optional: add chili flakes",
        "Cut tofu into cubes",
        "Add the aubergines and the cubed tofu into the sauce and submerge then allow to cook for 5-8 minutes on a low heat.",
        "Add soy sauce and sugar and combine adjust flavours with salt and pepper."
      ],
      "notes": [
        "I prepare veg stock by mixing 1 veg stock cube into 1 cup of boiling water"
      ]
    },
    {
      "name": "Chana Masala",
      "source": "https://www.youtube.com/watch?v=81qLj6Odfgs",
      "image": "chanamasala.png",
      "servings": 4,
      "ingredients": [
        "2 cans of chickpeas (including liquid)",
        "1 red onion",
        "2 garlic cloves",
        "1 thumb of ginger",
        "1 handfuls of coriander",
        "2 green chillies (stemmed and seeded to taste)",
        "1 can of tomatoes",
        "1 tsp (cashmere) chilli powder",
        "1 tsp cumin",
        "0.5 tsp turmeric",
        "0.5 tsp fennel seeds (powdered)",
        "1.5 tsp garam masala",
        "0.5 tsp salt (to taste)"
      ],
      "methods": [
        "Combine half the onions (0.5 if using 1, so forth), ginger, coriander, garlic and chillies to a food processor for about 20 seconds.",
        "Transfer mix to pot with cold/room temperature oil.",
        "Bring pot to a medium heat for about 5 minutes.",
        "In the meantime, add the tomatoes to a food processor for about 30 seconds",
        "Add chilli powder, cumin, turmeric and fennel seeds to the pan and combine.",
        "Add chickpeas and tomato blend to the pot.",
        "Stir, lower the heat, close and let it cook for about 15 minutes",
        "Add garam masala and salt at this stage.",
        "Let it cook for another 8 minutes.",
        "Cool down and serve with some rice, chapati or your carb of choice.",
        "Garnish with coriander, diced onion and some green chillies."
      ]
    },
    {
      "name": "Cilantro lime noodles",
      "source": "https://instagram.com/p/CcF1M-RDlg-",
      "image": null,
      "servings": 2,
      "ingredients": [
        "1 packet of knife-cut noodles",
        "1 Handful of cilantro",
        "1 tbsp red pepper flakes (mild/hot) - i used gochugaru",
        "1 tbsp sesame oil",
        "1 tbsp soy sauce",
        "0.5 tbsp rice vinegar",
        "0.5 tbsp lime juice",
        "1 tsp maple syrup",
        "2 tsp noodle water"
      ],
      "methods": [
        "Boil knife cut noodles according to package instructions and rinse with cold water.",
        "Combine gochugaru with cilantro.",
        "Add heated sesame oil to the mixture.",
        "Add the rest of the ingredients and give it a good mix.",
        "Pour over noodles, mix and top with toasted sesame seeds.",
        "Heat it up gently, and it's ready to serve!"
      ]
    },
    {
      "name": "Lemon Cashew Pasta",
      "source": "https://instagram.com/p/CVGA96hql9X",
      "image": null,
      "servings": 3,
      "ingredients": [
        "300 g whole wheat pasta",
        "1.5 tbsp olive oil",
        "1 medium onion",
        "4 cloves of garlic",
        "1 tbsp parsley stems",
        "1 tsp lemon zest",
        "80 g cashews",
        "120 ml veggie broth",
        "4 tbsp nutritional yeast",
        "2 lemons (juiced)",
        "1 handful of fresh herbs (parsley and basil)",
        "1 tsp salt and pepper (to taste)"
      ],
      "methods": [
        "Soak the cashews in hot water for at least 10 minutes.",
        "In a pan, sauté the onion until translucent, then add the garlic, parsley stems, and lemon zest and cook for a few more minutes.",
        "Deglaze the pan with a splash of lemon juice to release all the flavors.",
        "Blend the soaked cashews, veggie broth, nutritional yeast, and lemon juice in a blender or food processor to make the sauce",
        "Pour the sauce back into the pan and add some fresh herbs such as parsley or basil.",
        "Cook the pasta according to the packaging instructions until al dente, then save some pasta water",
        "Add the cooked pasta to the sauce, mix well, and add pasta water until it reaches your desired consistency."
      ]
    },
    {
      "name": "Pasta with Pistachio Pesto",
      "source": "https://instagram.com/p/CdLgaiPK4TS",
      "image": "pistachio-pesto-pasta.png",
      "servings": 3,
      "ingredients": [
        "300 g pasta of choice",
        "70 g pistachios (or more for a more prominent flavor)",
        "30 g other nuts or seeds",
        "2 handfuls of spinach",
        "0.5 lemon, juiced",
        "1 garlic clove",
        "2 tbsp nutritional yeast",
        "1 handful of fresh basil",
        "2 tbsp olive oil",
        "1 tsp salt & pepper (to taste)"
      ],
      "methods": [
        "Toast the nuts and seeds until slightly browned from all sides.",
        "Blend all ingredients for the pesto/sauce. Blend it as fine or coarse as you like.",
        "Cook the pasta according to packaging instructions.",
        "Add the pesto/sauce to a pan, loosen with some pasta water, then add in the pasta.",
        "Serve with some crushed pistachios and vegan parmesan - enjoy!"
      ]
    },
    {
      "name": "Red Lentil Dahl",
      "source": "https://avirtualvegan.com/instant-pot-lentil-dal/#recipe",
      "image": "dahl.png",
      "servings": 4,
      "ingredients": [
        "1 tablespoon olive oil, or use water for sautéing to make the recipe oil-free",
        "1 large onion, chopped",
        "4 large cloves garlic, chopped",
        "2 tablespoons fresh ginger, finely chopped or grated",
        "2 heaping teaspoons garam masala",
        "0.5 teaspoon ground cinnamon",
        "1 teaspoon red chili pepper flakes, add up to a teaspoon extra if you like it spicy. You can use 1 fresh small red chili if you prefer",
        "2 slightly heaping teaspoons ground turmeric",
        "2 teaspoons salt, plus more to taste at the end",
        "1 teaspoons ground black pepper, plus more to taste at the end",
        "400 grams of dried split red lentils, (no need to soak - but maybe rinse)",
        "1 can of tomatoes",
        "1 can of coconut milk"
      ],
      "methods": [
        "Combine all spices into a spice mix.",
        "Put oil in a pot, once hot, add onions.",
        "Once the onions have browned, add garlic and ginger and cook until fragrant (add more oil if necessary).",
        "Add the spice mix into the pot and stir until combined.",
        "Add 3 cups of water to the pot and mix, make sure to scratch the bottom of the pot with a wooden spoon to avoid burning at the bottom.",
        "Add the red lentils, tomatoes, and coconut milk to the pot.",
        "Bring the mix to a boil and stir throughout.",
        "Once boiling, bring down to a simmer, cover and let it cook for 15-20 minutes."
      ]
    },
    {
      "name": "The Smoothest Hummus",
      "source": "https://instagram.com/p/Cg9pcjSKTrC",
      "image": "hummus.jpeg",
      "servings": 4,
      "ingredients": [
        "1 Large Jar of good chickpeas",
        "1 Clove Garlic",
        "0.75 Cup good quality tahini",
        "0.5 lemon (juiced)",
        "0.33 cup chickpea brine",
        "0.75 ice cubes",
        "2 Tsp cumin",
        "2 Tbsp Olive oil",
        "1 tsp Salt"
      ],
      "methods": [
        "Boil some salted water, add the chickpeas and garlic into the water, but keep the chickpea brine separate.",
        "Boil the chickpeas for 20 minutes to half an hour.",
        "Drain the chickpeas once cooked and add to a blender with the chickpea brine and garlic clove from earlier.",
        "Blend until they form a paste-like consistency.",
        "Add in the tahini and blend, then whilst blending add in the ice cubes one at a time.",
        "Add in the cumin, olive oil, salt, and lemon juice and blend one last time or until it's as smooth as desired.",
        "Plate up the hummus, drizzle some olive oil over it and season with fresh parsley."
      ]
    }
  ]
}